ChannelTopoCHT/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0. -0.01 0.)
    (0.1 -0.01 0.)
    (0.1 0.01  0.)
    (0. 0.01 0.)
    (0. -0.01 0.01)
    (0.1 -0.01 0.01)
    (0.1 0.01  0.01)
    (0. 0.01 0.01)
    
    (0. -0.05 0.)
    (0.1 -0.05 0.)
    (0.1 -0.05 0.01)
    (0. -0.05 0.01)

    (0.  0.05 0.)
    (0.1 0.05  0.)
    (0.1 0.05  0.01)
    (0.  0.05 0.01)
);

blocks
(
  hex (0 1 2 3 4 5 6 7) (40 8 1) 
  simpleGrading (1 1 1)

  hex (8 9 1 0 11 10 5 4) (40 16 1) 
  simpleGrading (1 1 1)

  hex (3 2 13 12 7 6 14 15) (40 16 1) 
  simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    adiabatic
    {
        type wall;
        faces
        (
            (3 7 15 12)
            (8 11 4 0)
            (2 6 14 13)
            (9 10 5 1)
        );
    }
    wall_top
    {
        type wall;
        faces
	    (
            (12 13 14 15)
        );
    }
    wall_bot
    {
        type wall;
        faces
        (
            (8 9 10 11)
        );
    }

    syms
    {
        type symmetry;
        faces
        (
            (0 1 2 3)
            (8 9 1 0)
            (3 2 13 12)
            (4 5 6 7)
            (11 10 5 4)
            (7 6 14 15)
        );
    }
);

mergePatchPairs
(

);

// ************************************************************************* //
