ChannelTopoCHT/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          8;
        startFace       3120;
    }
    outlet
    {
        type            patch;
        nFaces          8;
        startFace       3128;
    }
    adiabatic
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       3136;
    }
    wall_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       3200;
    }
    wall_bot
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       3240;
    }
    syms
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          3200;
        startFace       3280;
    }
)

// ************************************************************************* //
